//========================================================================================
//		File        : FieldObject.h
//		Program     : フィールオブジェクトベース
//
//		Description : フィールドオブジェクトベースの定義
//
//		History     : 2015/05/6	作成開始
//						   
//
//																Author : きんたまズ
//========================================================================================

#pragma once

//――――――――――――――――――――――――――――――――――――――――――――
// インクルード
//――――――――――――――――――――――――――――――――――――――――――――
#include "../System/PreInclude.h"
#
#include <d3d9.h>
#include <d3dx9.h>
#include "../System/System.h"
#include "../Object/Character.h"

//――――――――――――――――――――――――――――――――――――――――――――
// クラス定義
//――――――――――――――――――――――――――――――――――――――――――――
class CFieldObject : public CCharacter
{
public:
	static CFieldObject* Create(const LPCTSTR pszFName);	// 生成
	virtual void Release();								// 破棄
};
//========================================================================================
//	End of File
//========================================================================================